Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_0_OFF (0u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_1_OFF (1u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_2_OFF (2u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_3_OFF (3u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_4_OFF (4u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_5_OFF (5u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_6_OFF (6u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_0_7_OFF (7u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_0_OFF (8u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_1_OFF (9u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_2_OFF (10u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_3_OFF (11u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_4_OFF (12u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_5_OFF (13u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_6_OFF (14u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_1_7_OFF (15u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_0_OFF (16u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_1_OFF (17u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_2_LEN (1u)

