Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ARU_IRQ_EN_Bits.ACC_ACK_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_ACC_ACK_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA1_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA1_OFF (1u)

/** \brief Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_OFF (2u)

/** \brief Length for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_LEN (7u)

/** \brief Mask for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_OFF (2u)

/** \brief Length for Ifx_GTM_ARU_CTRL_Bits.ARU_DYN_RING_MODE */
#define IFX_GTM_ARU_CTRL_ARU_DYN_RING_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_DYN_RING_MODE */
#define IFX_GTM_ARU_CTRL_ARU_DYN_RING_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_CTRL_Bits.ARU_DYN_RING_MODE */
#define IFX_GTM_ARU_CTRL_ARU_DYN_RING_MODE_OFF (4u)

/** \brief Length for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ARU_UPDATE_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ARU_UPDATE_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ARU_UPDATE_EN_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ROUTE_SWAP_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ROUTE_SWAP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_DYN_CTRL_DYN_ROUTE_SWAP_OFF (1u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID0_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID0_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID0_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID1_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID1_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID1_OFF (8u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID2_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID2_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_DYN_ROUTE_LOW_DYN_READ_ID2_OFF (16u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID3_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID3_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID3_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID4_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID4_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID4_OFF (8u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID5_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID5_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_READ_ID5_OFF (16u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_CLK_WAIT_LEN (4u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_DYN_ROUTE_HIGH_DYN_CLK_WAIT_MSK (0xfu)

