Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH8_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH9_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH10_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH11_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH11_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH11_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH12_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH12_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH12_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH13_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH14_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM0_CH15_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH8_IRQ_OFF (24u)

