Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH9_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH10_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH11_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH11_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH11_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH12_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH12_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH12_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH13_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH14_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R6_TOM1_CH15_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_OFF (10u)

