Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_OFF (17u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_OFF (20u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_OFF (21u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_OFF (22u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_OFF (24u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_OFF (25u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_OFF (28u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_OFF (29u)

/** \brief Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_LEN (1u)

/** \brief Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_OFF (30u)

/** \brief Length for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_LEN (2u)

/** \brief Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_OFF (0u)

/** \brief Length for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_LEN (2u)

/** \brief Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_OFF (2u)

/** \brief Length for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_LEN (2u)

/** \brief Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_OFF (4u)

/** \brief Length for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_LEN (2u)

/** \brief Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_OFF (6u)

/** \brief Length for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_LEN (2u)

/** \brief Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_OFF (8u)

/** \brief Length for Ifx_GTM_TIM_CH_GPR0_Bits.GPR0 */
#define IFX_GTM_TIM_CH_GPR0_GPR0_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_GPR0_Bits.GPR0 */
#define IFX_GTM_TIM_CH_GPR0_GPR0_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_GPR0_Bits.GPR0 */
#define IFX_GTM_TIM_CH_GPR0_GPR0_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_GPR0_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR0_ECNT_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_GPR0_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR0_ECNT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_GPR0_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR0_ECNT_OFF (24u)

/** \brief Length for Ifx_GTM_TIM_CH_GPR1_Bits.GPR1 */
#define IFX_GTM_TIM_CH_GPR1_GPR1_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_GPR1_Bits.GPR1 */
#define IFX_GTM_TIM_CH_GPR1_GPR1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_GPR1_Bits.GPR1 */
#define IFX_GTM_TIM_CH_GPR1_GPR1_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_GPR1_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR1_ECNT_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_GPR1_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR1_ECNT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_GPR1_Bits.ECNT */
#define IFX_GTM_TIM_CH_GPR1_ECNT_OFF (24u)

/** \brief Length for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_ECNT_Bits.ECNT */
#define IFX_GTM_TIM_CH_ECNT_ECNT_LEN (16u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECNT_Bits.ECNT */
#define IFX_GTM_TIM_CH_ECNT_ECNT_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_ECNT_Bits.ECNT */
#define IFX_GTM_TIM_CH_ECNT_ECNT_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_OFF (24u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_OFF (8u)

