Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_OFF (16u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TOV */
#define IFX_GTM_TIM_CH_TDUV_TOV_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TOV */
#define IFX_GTM_TIM_CH_TDUV_TOV_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TOV */
#define IFX_GTM_TIM_CH_TDUV_TOV_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_OFF (8u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TOV2 */
#define IFX_GTM_TIM_CH_TDUV_TOV2_LEN (8u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TOV2 */
#define IFX_GTM_TIM_CH_TDUV_TOV2_MSK (0xffu)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TOV2 */
#define IFX_GTM_TIM_CH_TDUV_TOV2_OFF (16u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_LEN (2u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_OFF (24u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_OFF (26u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_OFF (27u)

/** \brief Length for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_LEN (3u)

/** \brief Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_OFF (28u)

/** \brief Length for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_LEN (24u)

/** \brief Mask for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_EN */
#define IFX_GTM_TIM_CH_CTRL_TIM_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_EN */
#define IFX_GTM_TIM_CH_CTRL_TIM_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_EN */
#define IFX_GTM_TIM_CH_CTRL_TIM_EN_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_MODE */
#define IFX_GTM_TIM_CH_CTRL_TIM_MODE_LEN (3u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_MODE */
#define IFX_GTM_TIM_CH_CTRL_TIM_MODE_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.TIM_MODE */
#define IFX_GTM_TIM_CH_CTRL_TIM_MODE_OFF (1u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.OSM */
#define IFX_GTM_TIM_CH_CTRL_OSM_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.OSM */
#define IFX_GTM_TIM_CH_CTRL_OSM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.OSM */
#define IFX_GTM_TIM_CH_CTRL_OSM_OFF (4u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_OFF (5u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_OFF (6u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.TBU0_SEL */
#define IFX_GTM_TIM_CH_CTRL_TBU0_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.TBU0_SEL */
#define IFX_GTM_TIM_CH_CTRL_TBU0_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.TBU0_SEL */
#define IFX_GTM_TIM_CH_CTRL_TBU0_SEL_OFF (7u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.GPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR0_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.GPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR0_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.GPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR0_SEL_OFF (8u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.GPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR1_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.GPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR1_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.GPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_GPR1_SEL_OFF (10u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_OFF (12u)

/** \brief Length for Ifx_GTM_TIM_CH_CTRL_Bits.DSL */
#define IFX_GTM_TIM_CH_CTRL_DSL_LEN (1u)

