Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_RESYNC */
#define IFX_GTM_TIM_CH_ECTRL_TDU_RESYNC_OFF (16u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_LEN (2u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_OFF (22u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_OFF (24u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_OFF (25u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_OFF (28u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_OFF (29u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.ECLK_SEL */
#define IFX_GTM_TIM_CH_ECTRL_ECLK_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.ECLK_SEL */
#define IFX_GTM_TIM_CH_ECTRL_ECLK_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.ECLK_SEL */
#define IFX_GTM_TIM_CH_ECTRL_ECLK_SEL_OFF (30u)

/** \brief Length for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_OFF (31u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_OFF (1u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_OFF (2u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_OFF (3u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_OFF (4u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_OFF (5u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_EN_Bits.NEWVAL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_NEWVAL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_EN_Bits.NEWVAL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_NEWVAL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_EN_Bits.NEWVAL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_NEWVAL_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_EN_Bits.ECNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_ECNTOFL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_EN_Bits.ECNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_ECNTOFL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_EN_Bits.ECNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_ECNTOFL_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_EN_Bits.CNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_CNTOFL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_EN_Bits.CNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_CNTOFL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_EN_Bits.CNTOFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_CNTOFL_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_EN_Bits.GPROFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_GPROFL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_EN_Bits.GPROFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_GPROFL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_EN_Bits.GPROFL_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_GPROFL_IRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_TIM_CH_IRQ_EN_Bits.TODET_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_TODET_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_TIM_CH_IRQ_EN_Bits.TODET_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_TODET_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TIM_CH_IRQ_EN_Bits.TODET_IRQ_EN */
#define IFX_GTM_TIM_CH_IRQ_EN_TODET_IRQ_EN_OFF (4u)

