Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.PDI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PDI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.PDI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PDI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.PDI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PDI_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.PEI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PEI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.PEI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PEI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.PEI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PEI_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.SISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SISI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.SISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SISI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.SISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SISI_IRQ_EN_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.MSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MSI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.MSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MSI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.MSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MSI_IRQ_EN_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.MTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MTI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.MTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MTI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.MTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_MTI_IRQ_EN_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.SASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SASI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.SASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SASI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.SASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SASI_IRQ_EN_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TASI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TASI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TASI_IRQ_EN_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.PWI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PWI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.PWI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PWI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.PWI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PWI_IRQ_EN_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.GL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL1I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.GL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL1I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.GL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL1I_IRQ_EN_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.LL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL1I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.LL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL1I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.LL1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL1I_IRQ_EN_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.EI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_EI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.EI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_EI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.EI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_EI_IRQ_EN_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.GL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL2I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.GL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL2I_IRQ_EN_MSK (0x1u)

