Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_OCDS_OTBU2T_Bits.CV */
#define IFX_GTM_OCDS_OTBU2T_CV_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_OCDS_OTBU2T_Bits.CV */
#define IFX_GTM_OCDS_OTBU2T_CV_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OTBU2T_Bits.EN */
#define IFX_GTM_OCDS_OTBU2T_EN_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTBU3T_Bits.CV */
#define IFX_GTM_OCDS_OTBU3T_CV_LEN (24u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU3T_Bits.CV */
#define IFX_GTM_OCDS_OTBU3T_CV_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_OCDS_OTBU3T_Bits.CV */
#define IFX_GTM_OCDS_OTBU3T_CV_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTBU3T_Bits.EN */
#define IFX_GTM_OCDS_OTBU3T_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OTBU3T_Bits.EN */
#define IFX_GTM_OCDS_OTBU3T_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OTBU3T_Bits.EN */
#define IFX_GTM_OCDS_OTBU3T_EN_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGB0 */
#define IFX_GTM_OCDS_OTSS_OTGB0_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGB1 */
#define IFX_GTM_OCDS_OTSS_OTGB1_OFF (8u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGBM0 */
#define IFX_GTM_OCDS_OTSS_OTGBM0_OFF (16u)

/** \brief Length for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSS_Bits.OTGBM1 */
#define IFX_GTM_OCDS_OTSS_OTGBM1_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0LMT */
#define IFX_GTM_OCDS_OTSC0_B0LMT_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0LMI */
#define IFX_GTM_OCDS_OTSC0_B0LMI_OFF (4u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0HMT */
#define IFX_GTM_OCDS_OTSC0_B0HMT_OFF (8u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B0HMI */
#define IFX_GTM_OCDS_OTSC0_B0HMI_OFF (12u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1LMT */
#define IFX_GTM_OCDS_OTSC0_B1LMT_OFF (16u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1LMI */
#define IFX_GTM_OCDS_OTSC0_B1LMI_OFF (20u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_LEN (3u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1HMT */
#define IFX_GTM_OCDS_OTSC0_B1HMT_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC0_Bits.B1HMI */
#define IFX_GTM_OCDS_OTSC0_B1HMI_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OTSC1_Bits.MCS */
#define IFX_GTM_OCDS_OTSC1_MCS_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC1_Bits.MCS */
#define IFX_GTM_OCDS_OTSC1_MCS_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC1_Bits.MCS */
#define IFX_GTM_OCDS_OTSC1_MCS_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OTSC1_Bits.MI */
#define IFX_GTM_OCDS_OTSC1_MI_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC1_Bits.MI */
#define IFX_GTM_OCDS_OTSC1_MI_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OTSC1_Bits.MI */
#define IFX_GTM_OCDS_OTSC1_MI_OFF (4u)

/** \brief Length for Ifx_GTM_OCDS_OTSC1_Bits.MOE */
#define IFX_GTM_OCDS_OTSC1_MOE_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OTSC1_Bits.MOE */
#define IFX_GTM_OCDS_OTSC1_MOE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OTSC1_Bits.MOE */
#define IFX_GTM_OCDS_OTSC1_MOE_OFF (9u)

/** \brief Length for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_LEN (2u)

/** \brief Mask for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_OCDS_ODA_Bits.DRAC */
#define IFX_GTM_OCDS_ODA_DRAC_OFF (0u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUS */
#define IFX_GTM_OCDS_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUS_P */
#define IFX_GTM_OCDS_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_OCDS_OCS_Bits.SUSSTA */
#define IFX_GTM_OCDS_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH0SEL */
#define IFX_GTM_TIMINSEL_CH0SEL_OFF (0u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH1SEL */
#define IFX_GTM_TIMINSEL_CH1SEL_OFF (4u)

