Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH2SEL */
#define IFX_GTM_TIMINSEL_CH2SEL_OFF (8u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH3SEL */
#define IFX_GTM_TIMINSEL_CH3SEL_OFF (12u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH4SEL */
#define IFX_GTM_TIMINSEL_CH4SEL_OFF (16u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH5SEL */
#define IFX_GTM_TIMINSEL_CH5SEL_OFF (20u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH6SEL */
#define IFX_GTM_TIMINSEL_CH6SEL_OFF (24u)

/** \brief Length for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TIMINSEL_Bits.CH7SEL */
#define IFX_GTM_TIMINSEL_CH7SEL_OFF (28u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL0 */
#define IFX_GTM_TOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL1 */
#define IFX_GTM_TOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL2 */
#define IFX_GTM_TOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL3 */
#define IFX_GTM_TOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL4 */
#define IFX_GTM_TOUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL5 */
#define IFX_GTM_TOUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL6 */
#define IFX_GTM_TOUTSEL_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_TOUTSEL_Bits.SEL7 */
#define IFX_GTM_TOUTSEL_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL0 */
#define IFX_GTM_DSADCINSEL_INSEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL0 */
#define IFX_GTM_DSADCINSEL_INSEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL0 */
#define IFX_GTM_DSADCINSEL_INSEL0_OFF (0u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL1 */
#define IFX_GTM_DSADCINSEL_INSEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL1 */
#define IFX_GTM_DSADCINSEL_INSEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL1 */
#define IFX_GTM_DSADCINSEL_INSEL1_OFF (4u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL2 */
#define IFX_GTM_DSADCINSEL_INSEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL2 */
#define IFX_GTM_DSADCINSEL_INSEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL2 */
#define IFX_GTM_DSADCINSEL_INSEL2_OFF (8u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL3 */
#define IFX_GTM_DSADCINSEL_INSEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL3 */
#define IFX_GTM_DSADCINSEL_INSEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL3 */
#define IFX_GTM_DSADCINSEL_INSEL3_OFF (12u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL4 */
#define IFX_GTM_DSADCINSEL_INSEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL4 */
#define IFX_GTM_DSADCINSEL_INSEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL4 */
#define IFX_GTM_DSADCINSEL_INSEL4_OFF (16u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL5 */
#define IFX_GTM_DSADCINSEL_INSEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL5 */
#define IFX_GTM_DSADCINSEL_INSEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL5 */
#define IFX_GTM_DSADCINSEL_INSEL5_OFF (20u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL6 */
#define IFX_GTM_DSADCINSEL_INSEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL6 */
#define IFX_GTM_DSADCINSEL_INSEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_DSADCINSEL_Bits.INSEL6 */
#define IFX_GTM_DSADCINSEL_INSEL6_OFF (24u)

/** \brief Length for Ifx_GTM_DSADCINSEL_Bits.INSEL7 */
#define IFX_GTM_DSADCINSEL_INSEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_DSADCINSEL_Bits.INSEL7 */
#define IFX_GTM_DSADCINSEL_INSEL7_MSK (0xfu)

