Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_OFF (3u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_OFF (4u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_OFF (0u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_OFF (1u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_OFF (2u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_OFF (3u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_OFF (4u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_OFF (16u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_OFF (17u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_OFF (18u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_OFF (19u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_OFF (20u)

/** \brief Length for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_LEN (32u)

/** \brief Mask for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON1_Bits.SEL6 */
#define IFX_GTM_MSC_SET_CON1_SEL6_LEN (5u)

