Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5OUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5OUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5OUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL0 */
#define IFX_GTM_PSI5SOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL1 */
#define IFX_GTM_PSI5SOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL2 */
#define IFX_GTM_PSI5SOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL3 */
#define IFX_GTM_PSI5SOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL4 */
#define IFX_GTM_PSI5SOUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL5 */
#define IFX_GTM_PSI5SOUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL6 */
#define IFX_GTM_PSI5SOUTSEL_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_PSI5SOUTSEL_Bits.SEL7 */
#define IFX_GTM_PSI5SOUTSEL_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_LEN (4u)

/** \brief Mask for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_MSK (0xfu)

/** \brief Offset for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_OFF (0u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_OFF (0u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_OFF (2u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_OFF (4u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_OFF (6u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_OFF (8u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_OFF (16u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_OFF (18u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_OFF (20u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_MSK (0xfu)

