Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_OFF (22u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_OFF (23u)

/** \brief Length for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_LEN (8u)

/** \brief Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_MSK (0xffu)

/** \brief Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_OFF (12u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_OFF (20u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_LEN (2u)

