Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_OFF (1u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_OFF (2u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_OFF (3u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_OFF (4u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_OFF (5u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_OFF (6u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_OFF (7u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII0_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS0_OFF (1u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_0_OFF (2u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_0_OFF (3u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII1_OFF (8u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS1_OFF (9u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_1_OFF (10u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_1_OFF (11u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII2_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS2_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_2_OFF (18u)

